Revit 2027 API
Alignment.GetHCurveNormalAtStation Method
 Calculate 2d (X and Y components of returned vector) horizontal normal at given station.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetHCurveNormalAtStation(
	double station
)
Public Function GetHCurveNormalAtStation (
	station As Double
) As XYZ
public:
XYZ^ GetHCurveNormalAtStation(
	double station
)
member GetHCurveNormalAtStation :
        station : float -> XYZ
Parameters
station Double
Alignment station to calculate 2d horizontal normal for, in Revit internal model units (standard Imperial feet).
Return Value
XYZ
2d (X and Y components of returned vector) horizontal normal at given station.
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace